app/controllers/admin/posts_controller.rb

	def create
		@post = Post.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("title", "summary", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ffg"], ["summary", "dfgd"], ["created_at", "2021-11-18 11:11:30.032008"], ["updated_at", "2021-11-18 11:11:30.032008"]]

	def update

		if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2021-11-18 11:11:30.077944"], ["id", 18]]