app/views/tags/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 1]]
SELECT 1 AS one FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ? LIMIT ?  [["tag_id", 1], ["LIMIT", 1]]
---

<% if @tag.posts.empty? %>