app/views/posts/_post.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 7]]
---
	<section class="footer-summary">
		<%= raw post.tags.map(&:name).map{ |t| link_to t, tag_path(t), class: 'badge rounded-pill bg-primary' }.join(' ') %>