app/controllers/posts_controller.rb

	def index
		@posts = Post.paginate(page: params[:page], per_page: 4)
---
SELECT "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

	def create
		@post = Post.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("title", "summary", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "64564656"], ["summary", "456546"], ["created_at", "2021-09-21 07:44:32.588804"], ["updated_at", "2021-09-21 07:44:32.588804"]]

	def update

		if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "summary" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First title"], ["summary", "first sum"], ["body", "first body"], ["updated_at", "2021-09-20 13:52:00.609659"], ["id", 3]]